In [424]:
# Question 1
import pandas as pd

score = [
    [83, 92, 71],
    [81, 73, 66],
    [87, 85, 79],
    [93, 87, 88],
    [85, 96, 83],
    [77, 82, 88],
    [65, 67, 65],
    [75, 82, 91],
    [75, 68, 84],
    [86, 86, 96]
    ]

In [425]:
#1. Create DataFrames using  dictionary, tuple list and list of dictionaries. 
# dictionary

score_dic = { 
    'Mid_1': [83, 81, 87, 93, 85, 77, 65, 75, 75, 86],
    'Mid_2': [92, 73, 85, 87, 96, 82, 67, 82, 68, 86],
    'Final': [71, 66, 79, 88, 83, 88, 65, 91, 84, 96] }

df_dic = pd.DataFrame(score_dic)
print ('dictionary:', "\n",df_dic)

# tuple

score_tup = [
    score[0],
    score[1],
    score[2],
    score[3],
    score[4],
    score[5],
    score[6],
    score[7],
    score[8],
    score[9]
]

df_tup = pd.DataFrame (data=score_tup, columns= ['Mid_1', 'Mid_2', 'Final'] )
print ('tuple:', "\n",df_tup)


# list of dictionaries

score_lod = [
    {'Mid_1':83, 'Mid_2': 92,'Final': 71 },
    {'Mid_1':81, 'Mid_2': 73,'Final': 66 },
    {'Mid_1':87, 'Mid_2': 85,'Final': 79 },
    {'Mid_1':93, 'Mid_2': 87,'Final': 88 },
    {'Mid_1':85, 'Mid_2': 96,'Final': 83 },
    {'Mid_1':77, 'Mid_2': 82,'Final': 88 },
    {'Mid_1':65, 'Mid_2': 67,'Final': 65 },
    {'Mid_1':75, 'Mid_2': 82,'Final': 91 },
    {'Mid_1':75, 'Mid_2': 68,'Final': 84 },
    {'Mid_1':86, 'Mid_2': 86,'Final': 96 },
    ]
   

df_lod = pd.DataFrame (data=score_lod, columns=['Mid_1', 'Mid_2', 'Final'])
print ('list of dictionaries', "\n", df_lod)

dictionary:
    Mid_1  Mid_2  Final
0     83     92     71
1     81     73     66
2     87     85     79
3     93     87     88
4     85     96     83
5     77     82     88
6     65     67     65
7     75     82     91
8     75     68     84
9     86     86     96
tuple:
    Mid_1  Mid_2  Final
0     83     92     71
1     81     73     66
2     87     85     79
3     93     87     88
4     85     96     83
5     77     82     88
6     65     67     65
7     75     82     91
8     75     68     84
9     86     86     96
list of dictionaries
    Mid_1  Mid_2  Final
0     83     92     71
1     81     73     66
2     87     85     79
3     93     87     88
4     85     96     83
5     77     82     88
6     65     67     65
7     75     82     91
8     75     68     84
9     86     86     96

In [426]:
# 2. Write the Dataframe in both csv and xlxs files. 
df_lod.to_csv (r'D:\Morgan\COSC502\hw_2.csv',index=False)
df_tup.to_excel (r'D:\Morgan\COSC502\hw_2.xlsx',index=False)

In [427]:
# 3. Read the csv and xlxs files again (created in previous step) as a Dataframe object.  
df_csv = pd.read_csv (r'D:\Morgan\COSC502\hw_2.csv')
df_excel = pd.read_excel (r'D:\Morgan\COSC502\hw_2.xlsx')
print (df_csv)

   Mid_1  Mid_2  Final
0     83     92     71
1     81     73     66
2     87     85     79
3     93     87     88
4     85     96     83
5     77     82     88
6     65     67     65
7     75     82     91
8     75     68     84
9     86     86     96

In [428]:
# 4. Calculate the average of the grades in each column and each row.  
print ('Mean column:')
print (df_csv.mean (axis=0))

print ('Mean row:')
print (df_csv.mean (axis=1))

Mean column:
Mid_1    80.7
Mid_2    81.8
Final    81.1
dtype: float64
Mean row:
0    82.000000
1    73.333333
2    83.666667
3    89.333333
4    88.000000
5    82.333333
6    65.666667
7    82.666667
8    75.666667
9    89.333333
dtype: float64

In [429]:
# 5.  Calculate the maximum and minimum scores for Midterm1, Midterm 2 and Final. 
print ('Max:')
print (df_csv.max())

print ('Min:')
print (df_csv.min())

Max:
Mid_1    93
Mid_2    96
Final    96
dtype: int64
Min:
Mid_1    65
Mid_2    67
Final    65
dtype: int64

In [430]:
# 6. Calculate the average of the grade of the first two and last two students.  
print ('First 2')
print (df_csv.head(2).mean(axis=1))

print ('Last 2')
print (df_csv.tail(2).mean(axis=1))

First 2
0    82.000000
1    73.333333
dtype: float64
Last 2
8    75.666667
9    89.333333
dtype: float64

In [431]:
# 7.  Calculate the average of Midterm 1 and Midterm 2 grades of the first 10 students.  

print (df_csv.iloc[0:10,0:2].mean(axis=1))

0    87.5
1    77.0
2    86.0
3    90.0
4    90.5
5    79.5
6    66.0
7    78.5
8    71.5
9    86.0
dtype: float64

In [432]:
# 8. Change any score <70 to 70 and calculate the average of the grades in Midterm1 and Final only for every alternate student. 
df_8 = df_csv.loc [(df_csv['Mid_1']<70) | (df_csv['Mid_2']<70) | (df_csv['Final']<70)] 

df_8.loc [df_8['Mid_1']<70,'Mid_1'] =70
df_8.loc [df_8['Mid_2']<70,'Mid_2'] =70
df_8.loc [df_8['Final']<70,'Final'] =70

print ("Mid_1")
print (df_8.mean(axis=0)[0])

print ("Final")
print (df_8.mean(axis=0)[2])

Mid_1
75.33333333333333
Final
74.66666666666667

C:\Users\try\AppData\Local\Temp\ipykernel_8012\1830199215.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_8.loc [df_8['Mid_1']<70,'Mid_1'] =70
C:\Users\try\AppData\Local\Temp\ipykernel_8012\1830199215.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_8.loc [df_8['Mid_2']<70,'Mid_2'] =70
C:\Users\try\AppData\Local\Temp\ipykernel_8012\1830199215.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_8.loc [df_8['Final']<70,'Final'] =70

In [433]:
# 9. Print the table (DataFrame) and show the statistics both exam and student wise. 
print (df_csv)

print ('For exam')
print (df_csv.describe())

print ('For student')
print (df_csv.apply(pd.DataFrame.describe,axis=1))

   Mid_1  Mid_2  Final
0     83     92     71
1     81     73     66
2     87     85     79
3     93     87     88
4     85     96     83
5     77     82     88
6     65     67     65
7     75     82     91
8     75     68     84
9     86     86     96
For exam
           Mid_1      Mid_2      Final
count  10.000000  10.000000  10.000000
mean   80.700000  81.800000  81.100000
std     7.944949   9.704524  10.650509
min    65.000000  67.000000  65.000000
25%    75.500000  75.250000  73.000000
50%    82.000000  83.500000  83.500000
75%    85.750000  86.750000  88.000000
max    93.000000  96.000000  96.000000
For student
   count       mean        std   min   25%   50%   75%   max
0    3.0  82.000000  10.535654  71.0  77.0  83.0  87.5  92.0
1    3.0  73.333333   7.505553  66.0  69.5  73.0  77.0  81.0
2    3.0  83.666667   4.163332  79.0  82.0  85.0  86.0  87.0
3    3.0  89.333333   3.214550  87.0  87.5  88.0  90.5  93.0
4    3.0  88.000000   7.000000  83.0  84.0  85.0  90.5  96.0
5    3.0  82.333333   5.507571  77.0  79.5  82.0  85.0  88.0
6    3.0  65.666667   1.154701  65.0  65.0  65.0  66.0  67.0
7    3.0  82.666667   8.020806  75.0  78.5  82.0  86.5  91.0
8    3.0  75.666667   8.020806  68.0  71.5  75.0  79.5  84.0
9    3.0  89.333333   5.773503  86.0  86.0  86.0  91.0  96.0

In [434]:
# 10. Print the student who has the highest score in the Final and student who has the highest total score (Mid 1+ Mid2 + Final). 
print (df_csv.idxmax())

print ('Final')
print (df_csv.loc[9])

print ('Total')
print (df_csv.loc[df_csv.sum(axis=1).idxmax()])

Mid_1    3
Mid_2    4
Final    9
dtype: int64
Final
Mid_1    86
Mid_2    86
Final    96
Name: 9, dtype: int64
Total
Mid_1    93
Mid_2    87
Final    88
Name: 3, dtype: int64

In [435]:
# Question 2

In [436]:
# 1. Read the csv file and provide summary of the DataFrame by printing the object.      

df = pd.read_csv (r'D:\employees.csv')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [437]:
# 2. Fill all the null values in Gender column with “No Gender” and 'Senior Management' column with “Don’t Know”. 

df['Gender'] = df['Gender'].fillna ('No Gender')
df['Senior Management'] = df['Senior Management'].fillna ('Don’t Know')

df[20:30]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
20,Lois,No Gender,1995-04-22,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,1995-09-05,2:12 AM,100612,13.645,False,Marketing
22,Joshua,No Gender,2012-03-08,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,2012-06-14,4:19 PM,125792,5.042,Don’t Know,NaN
24,John,Male,1992-07-01,10:08 PM,97950,13.873,False,Client Services
25,NaN,Male,2012-10-08,1:12 AM,37076,18.576,Don’t Know,Client Services
26,Craig,Male,2000-02-27,7:45 AM,37598,7.757,True,Marketing
27,Scott,No Gender,1991-07-11,6:58 PM,122367,5.218,False,Legal
28,Terry,Male,1981-11-27,6:30 PM,124008,13.464,True,Client Services
29,Benjamin,Male,2005-01-26,10:06 PM,79529,7.008,True,Legal

In [438]:
# 3. Using the fillna (0), fillna () with method ‘ffill’  and interpolate () function to fill the 
df_s_0 = df['Salary'].fillna(0)
df_s_ffill = df['Salary'].fillna(method='ffill')
df_s_int = df['Salary'].interpolate()

print ('For Salary')
print ('fillna(0)')
print (df_s_0.mean())

print ('ffill')
print (df_s_ffill.mean())

print ('interpolate')
print (df_s_int.mean())

df_b_0 = df['Bonus %'].fillna(0)
df_b_ffill = df['Bonus %'].fillna(method='ffill')
df_b_int = df['Bonus %'].interpolate()

print ('For Bonus %')
print ('fillna(0)')
print (df_b_0.mean())

print ('ffill')
print (df_b_ffill.mean())

print ('interpolate')
print (df_b_int.mean())

For Salary
fillna(0)
90662.181
ffill
90662.181
interpolate
90662.181
For Bonus %
fillna(0)
10.207555000000001
ffill
10.207555000000001
interpolate
10.207555000000001

In [439]:
# 4. Filter the rows to only show employee with Salaries >100K. 
df.loc[df['Salary']>1e+5]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,1:35 AM,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,6:51 AM,139852,7.524,True,Business Development
...,...,...,...,...,...,...,...,...
990,Robin,Female,1987-07-24,1:35 PM,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,5:12 AM,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,8:35 AM,112769,11.625,True,Finance
995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [440]:
# 5. Print the names of male and female employees with highest and lowest salaries. 
Female_max = df.loc[df['Gender']=='Female'].max(numeric_only=True)[0]
Max_Name = df.loc[df['Salary']==Female_max]
print ('Max:', Max_Name['First Name'].item(), Female_max)

Female_min = df.loc[df['Gender']=='Female'].min(numeric_only=True)[0]
Min_Name = df.loc[df['Salary']==Female_min]
print ('Min:', Min_Name['First Name'].item(), Female_min)

Max: Katherine 149908.0
Min: Cynthia 35381.0

In [441]:
# 6.For each Team, calculate the minimum and maximum salaries. 
print (df.groupby('Team').max(numeric_only=True))
print (df.groupby('Team').min(numeric_only=True))

                      Salary  Bonus %
Team
Business Development  147417   19.626
Client Services       147183   19.894
Distribution          149105   19.908
Engineering           147362   19.850
Finance               149908   19.930
Human Resources       149903   19.612
Legal                 148985   19.944
Marketing             149456   19.934
Product               149684   19.264
Sales                 149654   19.388
                      Salary  Bonus %
Team
Business Development   36844    1.027
Client Services        35095    1.015
Distribution           35575    1.679
Engineering            36946    1.017
Finance                35381    1.148
Human Resources        35203    1.113
Legal                  35061    1.079
Marketing              36643    1.260
Product                35013    1.022
Sales                  35802    1.215

In [442]:
# 7. Find the maximum and average salary of Male and Female as different groups. 
M_ = df.loc[df['Gender']=='Male']
M_Max = M_.groupby ('Team').max()
M_Ave = M_.groupby ('Team').mean()
print ('Male Max:', M_Max['Salary'])
print ('Male Ave:', M_Ave['Salary'])

Male Max: Team
Business Development    147417
Client Services         144082
Distribution            146141
Engineering             146907
Finance                 148225
Human Resources         146670
Legal                   148985
Marketing               146812
Product                 148941
Sales                   142178
Name: Salary, dtype: int64
Male Ave: Team
Business Development    89071.750000
Client Services         93141.833333
Distribution            93861.800000
Engineering             98408.250000
Finance                 95507.731707
Human Resources         91368.733333
Legal                   84254.657143
Marketing               86082.365854
Product                 88957.825000
Sales                   93196.666667
Name: Salary, dtype: float64

C:\Users\try\AppData\Local\Temp\ipykernel_8012\1872052840.py:3: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  M_Max = M_.groupby ('Team').max()
C:\Users\try\AppData\Local\Temp\ipykernel_8012\1872052840.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  M_Ave = M_.groupby ('Team').mean()

In [443]:
# 7. Find the maximum and average salary of Male and Female as different groups. 
F_ = df.loc[df['Gender']=='Female']
F_Max = F_.groupby ('Team').max()
F_Ave = F_.groupby ('Team').mean()
print ('Female Max:', F_Max['Salary'])
print ('Female Ave:', F_Ave['Salary'])

Female Max: Team
Business Development    147183
Client Services         147183
Distribution            149105
Engineering             147362
Finance                 149908
Human Resources         149903
Legal                   147113
Marketing               145988
Product                 149684
Sales                   149654
Name: Salary, dtype: int64
Female Ave: Team
Business Development    92669.060000
Client Services         86430.083333
Distribution            81328.162162
Engineering             90311.045455
Finance                 92203.454545
Human Resources         93581.837838
Legal                   90790.382353
Marketing               95074.250000
Product                 86182.644444
Sales                   89814.564103
Name: Salary, dtype: float64

C:\Users\try\AppData\Local\Temp\ipykernel_8012\3130651903.py:3: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  F_Max = F_.groupby ('Team').max()
C:\Users\try\AppData\Local\Temp\ipykernel_8012\3130651903.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  F_Ave = F_.groupby ('Team').mean()

In [444]:
# 8. For each combination of Team  and Gender, calculate the mean salary. 

# This is already finished in question 7

In [445]:
# 9. Check the number of rows and columns and drop those row if 'any' values are missing in a row. 
print ('Rows:',len(df.axes[0]))
print ('Columns:', len(df.axes[1]))
df.dropna()

Rows: 1000
Columns: 8

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,1:35 AM,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [446]:
# 10. Find all the employees whose bonuses are in the  range of  >=5% and <10%. 
df.loc[ (df['Bonus %']>= 5) & (df['Bonus %']<10)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
9,Frances,Female,2002-08-08,6:51 AM,139852,7.524,True,Business Development
13,Gary,Male,2008-01-27,11:40 PM,109831,5.831,False,Sales
16,Jeremy,Male,2010-09-21,5:56 AM,90370,7.369,False,Human Resources
...,...,...,...,...,...,...,...,...
966,Louis,Male,2011-08-16,5:19 PM,93022,9.146,True,Human Resources
971,Patrick,Male,2002-12-30,2:01 AM,75423,5.368,True,Business Development
977,Sarah,Female,1995-12-04,9:16 AM,124566,5.949,False,Product
980,Kimberly,Female,2013-01-26,12:57 AM,46233,8.862,True,Engineering
982,Rose,Female,1982-04-06,10:43 AM,91411,8.639,True,Human Resources

In [447]:
# 11. Find the total salary of each employee by considering both base salary and bonus and  add it as an extra column “Total Salary” at the end. 

df['Total Salary'] = df['Salary']*(1+0.01*df['Bonus %'])
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Total Salary
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing,104066.04060
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN,64515.60610
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance,146075.36220
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance,151660.04700
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services,102406.94556

In [448]:
# 12. Sort the dataset with 'Start Date' and replace it as the index. 
df.sort_values(by='Start Date')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Total Salary
954,Joe,Male,1980-01-19,4:06 PM,119667,1.148,True,Finance,121040.77716
49,Chris,No Gender,1980-01-24,12:13 PM,113590,3.055,False,Sales,117060.17450
881,Ruby,Female,1980-01-28,11:08 PM,142868,6.318,False,Marketing,151894.40024
272,Fred,Male,1980-02-20,2:25 AM,74129,18.225,False,Product,87639.01025
549,Sara,Female,1980-02-25,10:50 PM,75484,3.186,False,Finance,77888.92024
...,...,...,...,...,...,...,...,...,...
239,Lillian,No Gender,2016-05-12,3:43 PM,64164,17.612,False,Human Resources,75464.56368
444,NaN,Male,2016-05-24,9:17 PM,76409,7.008,Don’t Know,Distribution,81763.74272
15,Lillian,Female,2016-06-05,6:09 AM,59414,1.256,False,Product,60160.23984
98,Tina,Female,2016-06-16,7:47 PM,100705,16.961,True,Marketing,117785.57505
451,Terry,No Gender,2016-07-15,12:29 AM,140002,19.490,True,Marketing,167288.38980

In [449]:
# 13. Find the employees who joined in the years between  2000-2010. 
df.loc[ (df['Start Date'] >= '2000-01-01') & (df['Start Date']<='2010-12-31')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Total Salary
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance,151660.04700
8,Angela,Female,2005-11-22,6:29 AM,95570,18.523,True,Engineering,113272.43110
9,Frances,Female,2002-08-08,6:51 AM,139852,7.524,True,Business Development,150374.46448
13,Gary,Male,2008-01-27,11:40 PM,109831,5.831,False,Sales,116235.24561
16,Jeremy,Male,2010-09-21,5:56 AM,90370,7.369,False,Human Resources,97029.36530
...,...,...,...,...,...,...,...,...,...
969,Linda,Female,2010-02-04,8:49 PM,44486,17.308,True,Engineering,52185.63688
971,Patrick,Male,2002-12-30,2:01 AM,75423,5.368,True,Business Development,79471.70664
972,Victor,No Gender,2006-07-28,2:49 PM,76381,11.159,True,Sales,84904.35579
988,Alice,Female,2004-10-05,9:34 AM,47638,11.209,False,Human Resources,52977.74342
991,Rose,Female,2002-08-25,5:12 AM,134505,11.051,True,Marketing,149369.14755

In [507]:
# 14. Use  apply() to find the difference between Max and Min  Salary and Max and Min Bonus. 
import numpy as np
df_14 = df[['Salary','Bonus %']]
df_14.apply(np.ptp, axis=0)

Salary     114895.000
Bonus %        18.929
dtype: float64